// arrays_sort.cpp

#include <iostream>  /* cin, cout    */
#include <stdlib.h>  /* srand, rand  */

using namespace std; /* для cin, cout */

int main(int argc, char** argv) 
{	
	int a[200] = {0};
       
        /* Задаем начальное значение в генераторе случайных чисел */
        srand(666);   

        /* 
           Генерируем массив из случайных чисел в диапазоне 
           (-RAND_MAX/2; +RAND_MAX/2)
        */
        for (int i = 0; i<200; i++){
			a[i] = rand() - (int)(RAND_MAX/2.0);
			cout << a[i] << "  ";	
	}

	/* 
        Здесь вставляйте свой код! 
        */


//////////////////////////////////////////////////////////

  int b[100][100] = {0}; /* инициализируем нулями */
	
	/* Задаем начальное значение в генераторе случайных чисел */
	srand(666);
	 
	/* 
        Генерируем массив из случайных чисел в диапазоне 
		[-500; 499] 
	*/
		 
	for (int i = 0; i<100; i++){
		for (int j = 0; j<100; j++){
			a[i][j] = rand()%1000 - 500;
		}
	}

        /* 
        Здесь вставляйте свой код! 
        */

        system("Pause");
	return 0;
}